# RbsBuildingConstructionclass Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsBuildingConstructionclass Property
ParameterTypeId Class See Also
---
"Building Infiltration Class"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsBuildingConstructionclass { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsBuildingConstructionclass As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsBuildingConstructionclass {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace